Reports/ОтчетПоЗаказамПоставщикуОбщий1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоЗаказамПоставщикуОбщий1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДнейПродажВГруппировке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаАнализа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТТМиниТТПусто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоВВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеСтолбцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеРаспределения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНормативныйКвантДляРасчетаПлановогоОстатка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоПерекрестки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоПятерочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчетПоЗаказамПоставщикуОбщий1/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДнейПродажВГруппировке 	= 7;
	Отчет.ГлубинаАнализа 			= 14;
	
	////+++АК KIRN 2018.09.16 ИП-00012852.08.000.00002
	Отчет.ИспользоватьНормативныйКвантДляРасчетаПлановогоОстатка = Истина;
	//---АК KIRN 

	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТТМиниТТПустоПриИзменении(Элемент)
	
	Если Отчет.ВыводитьТТМиниТТПусто Тогда
		Отчет.ВыводитьТолькоВВ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТолькоВВПриИзменении(Элемент)
	
	Если Отчет.ВыводитьТолькоВВ Тогда
		Отчет.ВыводитьТТМиниТТПусто = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьКомпоновщикНастроек()
	
	ОтчетОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	
	мСхемаКомпоновки = ОтчетОбъект.ПолучитьМакет(?(Отчет.ВыводитьДополнительныеСтолбцы, "ДопМакет", "Макет"));
	
	мКомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	мКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(мСхемаКомпоновки));
	мКомпоновщикНастроек.ЗагрузитьНастройки(мСхемаКомпоновки.НастройкиПоУмолчанию);
	
	Возврат мКомпоновщикНастроек;
	
КонецФункции

&НаКлиенте
Процедура ВыводитьДополнительныеСтолбцыПриИзменении(Элемент)

	Отчет.КомпоновщикНастроек = ПолучитьКомпоновщикНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТолькоПерекресткиПриИзменении(Элемент)
	Если Отчет.ВыводитьТолькоПерекрестки Тогда
		Отчет.ВыводитьТолькоПятерочки = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТолькоПятерочкиПриИзменении(Элемент)
	Если Отчет.ВыводитьТолькоПятерочки Тогда
		Отчет.ВыводитьТолькоПерекрестки = Ложь;
	КонецЕсли;
КонецПроцедуры
